{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "label_a", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "label_b", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "dot", 
      "param": {}, 
      "name": "dot15", 
      "inputs": [[0, 0], [1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus5", 
      "inputs": [[2, 0], [3, 0]], 
      "backward_source_id": -1
    }
  ], 
  "arg_nodes": [0, 1, 3], 
  "heads": [[4, 0]]
}